orgtbl-major-mode.org
#+auto_tangle: t
* header
#+begin_src emacs-lisp :tangle yes
;;; orgtbl-major-mode.el --- Orgtbl files -*- lexical-binding: t; -*-

;; Author: Earl Chase
;; Maintainer: Earl Chase
;; Version: 0.0
;; Keywords: org
;; Package-Requires: ((emacs "30") (org "9.7"))
;; This file is NOT part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Commentary:

;; Tracking

;;; Code: Attempt to use org files with very large org-tables

#+end_src

* imports
:LOGBOOK:
CLOCK: [2025-12-28 Sun 01:30]--[2025-12-28 Sun 01:32] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (require 'org)
  (require 'org-table)

#+end_src

* notes
#+begin_src elisp :tangle no

    (setq
     Display-buffer-alist
     `(("\\*Buffer List\\*" display-buffer-in-side-window
        (side . top) (slot . 0) (window-height . fit-window-to-buffer)
        (preserve-size . (nil . t)) ,parameters)
       ("\\*Tags List\\*" display-buffer-in-side-window
        (side . right) (slot . 0) (window-width . fit-window-to-buffer)
        (preserve-size . (t . nil)) ,parameters)
       ("\\*\\(?:help\\|grep\\|Completions\\)\\*"
        display-buffer-in-side-window
        (side . bottom) (slot . -1) (preserve-size . (nil . t))
        ,parameters)
        ("\\*\\(?:shell\\|compilation\\)\\*" display-buffer-in-side-window
         (side . bottom) (slot . 1) (preserve-size . (nil . t))
         ,parameters)))

#+end_src
* org-table-goto-line-column
#+begin_src elisp :tangle yes
  (defsubst org-table--goto-line-column (line column)
    (org-table-goto-line line)
    (org-table-goto-column column))
#+end_src
* org-table-autofill
:LOGBOOK:
CLOCK: [2026-01-08 Thu 06:59]--[2026-01-08 Thu 06:59] =>  0:00
CLOCK: [2025-11-28 Fri 00:47]--[2025-11-28 Fri 00:58] =>  0:11
CLOCK: [2025-11-28 Fri 00:43]--[2025-11-28 Fri 00:43] =>  0:00
CLOCK: [2025-11-27 Thu 03:24]--[2025-11-27 Thu 03:27] =>  0:03
CLOCK: [2025-11-27 Thu 00:21]--[2025-11-27 Thu 00:33] =>  0:12
CLOCK: [2025-11-26 Wed 21:51]--[2025-11-26 Wed 22:01] =>  0:10
CLOCK: [2025-11-26 Wed 16:53]--[2025-11-26 Wed 16:54] =>  0:01
CLOCK: [2025-11-23 Sun 00:13]--[2025-11-23 Sun 00:30] =>  0:17
CLOCK: [2025-11-22 Sat 23:42]--[2025-11-23 Sun 00:08] =>  0:26
CLOCK: [2025-11-22 Sat 21:14]--[2025-11-22 Sat 21:34] =>  0:20
:END:
#+begin_src elisp :tangle yes

  (defsubst org--no-properties-and-trim (s &optional restricted)
  "Remove all text properties from string S and then trim the result.
  When RESTRICTED is non-nil, only remove the properties listed
   in `org-rm-props'."
  (if restricted (remove-text-properties 0 (length s) org-rm-props s)
    (set-text-properties 0 (length s) nil s))
  (org-trim s))

  (defsubst org-table--goto-char-and-get-column (char)
    (save-excursion
      (goto-char char)
      (org-table-check-inside-data-field nil t)
      (org-table-current-column)))

  (defsubst org-table--goto-char-and-get-line (char)
    (save-excursion
      (goto-char char)
      (org-table-check-inside-data-field nil t)
      (org-table-current-line)))

  (defsubst org-table--get-fill-direction (beg end)
    "Helper function for org-table-autofill.
    Use the BEG and END of selection to determine
    the direction of fill."
    (pcase (- beg end) 
      ((pred zerop) #'(lambda (x y) x))
      ((pred plusp) #'-)
      ((pred minusp) #'+)))

  (defsubst org-table--get-point-for-line-column (line column)
    (save-excursion
      (org-table--goto-line-column line column)
      (point)))

  ;; incrementing + prefix arguments are next
  (defun org-table-autofill (beg end)
  "Copy the value of BEG and paste it into all cells between BEG and END.
  This works in any direction: left, right, down right or up left.
  With a prefix argument, if the field is a number, a timestamp,
  or is either prefixed or suffixed with a number,
  the value from BEG will be increment each time its pasted into a cell."
    (interactive (list (mark) (point)))  		
    (let* ((beg-col (org-table--goto-char-and-get-column beg))
     (end-col (org-table--goto-char-and-get-column end))
     (beg-row (org-table--goto-char-and-get-line beg))
     (end-row (org-table--goto-char-and-get-line end))
     (auto-fill-value (org-table-get beg-row beg-col))
     (columns (1+ (abs (- beg-col end-col))))
     (rows (1+ (abs (- beg-row end-row))))
     (left-or-right? (org-table--get-fill-direction beg-col end-col))
     (up-or-down? (org-table--get-fill-direction beg-row end-row)))
      (dotimes (row rows)
        (let ((line (funcall up-or-down? beg-row row)))
       (dotimes (column columns)
         (org-table-put line (funcall left-or-right? beg-col column) auto-fill-value))))
    (org-table-align)
    (goto-char (org-table--get-point-for-line-column end-row end-col))

    (set-mark (org-table--get-point-for-line-column beg-row beg-col))))

#+end_src

#+RESULTS:
: org-table-autofill

* TODO org-table-map-cells
** helpers
#+begin_src elisp :tangle yes
  (defsubst org-table--count-rows ())    
#+end_src
** org-table--create-table-iterator
#+begin_src elisp :tangle yes
  (iter-defun org-table--create-table-iterator (rows cols)
    (let* ((total-cells (* rows cols))
  	 (max-col-num (1+ cols))
  	 (current-col 1)
  	 (current-row 1))
      (dotimes (cell-num total-cells)
        (let* ((new-col (mod cell-num max-col-num)))
  	(if (equal new-col 0)
  	    (setq current-col 1
  		  current-row (1+ current-row))
  	  (setq current-col new-col))
  	(iter-yield (list (always current-row current-col) current-row current-col))))))
  
    
#+end_src
** defun
:LOGBOOK:
CLOCK: [2026-01-08 Thu 21:49]--[2026-01-08 Thu 22:10] =>  0:21
CLOCK: [2026-01-08 Thu 21:48]--[2026-01-08 Thu 21:49] =>  0:01
CLOCK: [2026-01-08 Thu 19:15]--[2026-01-08 Thu 19:35] =>  0:20
CLOCK: [2026-01-08 Thu 12:12]--[2026-01-08 Thu 12:27] =>  0:15
CLOCK: [2026-01-08 Thu 09:42]--[2026-01-08 Thu 09:44] =>  0:02
:END:
#+begin_src elisp :tangle yes
  (defun org-table-map-cells (func)
    (goto-char (org-table-begin))
    (let* ((rows (org-table--count-rows))
  	 (cols (org-table--count-cols))
  	 (table-iterator (org-table--create-table-iterator rows cols)))
      (iter-do (cell-row-col table-iterator)
        (funcall func cell-row-col))))
#+end_src
* Tasks
** TODO Fix combine-change-calls-1: Marker does not point anywhere
** TODO group
:LOGBOOK:
CLOCK: [2025-12-19 Fri 04:34]--[2025-12-19 Fri 04:40] =>  0:06
:END:
#+begin_src elisp :tangle yes

#+end_src
** TODO keymap
:LOGBOOK:
CLOCK: [2026-01-10 Sat 10:56]--[2026-01-10 Sat 10:56] =>  0:00
CLOCK: [2025-12-19 Fri 04:16]--[2025-12-19 Fri 04:23] =>  0:07
CLOCK: [2025-11-22 Sat 06:57]--[2025-11-22 Sat 07:07] =>  0:10
:END:
#+begin_src elisp :tangle yes

  (defvar-keymap orgtbl-major-mode-map
    :doc "Keymap for `orgtbl-major-mode'."
    "C-c C-w"		 #'org-table-cut-region
    "C-c M-w"		 #'org-table-copy-region
    "C-c C-y"		 #'org-table-paste-rectangle
    "C-c C-="		 #'org-table-autofill
    "C-c -"		 #'org-table-insert-hline
    "C-c C-c"		 #'org-table-align
    "C-c }"		 #'org-table-toggle-coordinate-overlays
    "C-c {"		 #'org-table-toggle-formula-debugger
    "C-m"		 #'org-table-next-row
    "C-c ?"		 #'org-table-field-info
    "C-c +"		 #'org-table-sum
    "C-c ="		 #'org-table-eval-formula
    "C-c '"		 #'org-table-edit-formulas
    "C-c `"		 #'org-table-edit-field
    "C-c *"		 #'org-table-recalculate
    "C-c ^"		 #'org-table-sort-lines
    "M-a"		 #'org-table-beginning-of-field
    "M-e"		 #'org-table-end-of-field
    "M-f"		 #'org-table-next-field
    "M-b"		 #'org-table-previous-field
    "C-x n r"            #'org-table-narrow-to-first-x-rows)


  (defvar-keymap orgtbl-major-mode-repeat-map
    :doc "Keymap for `orgtbl-major-mode' when repeat-mode is active."
    :repeat t
    "m"		 #'org-table-next-row
    "f"		 #'org-table-next-field
    "b"		 #'org-table-previous-field)


#+end_src

#+RESULTS:
: orgtbl-major-mode-map
** TODO create repeat-mode keymap
:LOGBOOK:
CLOCK: [2026-01-10 Sat 10:56]--[2026-01-10 Sat 11:04] =>  0:08
:END:
** TODO add narrow to keymap
:LOGBOOK:
CLOCK: [2026-01-10 Sat 11:04]--[2026-01-10 Sat 11:05] =>  0:01
:END:
** TODO org-table-goto-next-empty-field
** TODO [#A] org-edit-org-table
** TODO [#A] org-table-last-filled-cell
#+begin_src elisp :tangle yes
(defun fac (n)
 (if (< 0 n)
	 (* n (fac (1- n)))
       1))
#+end_src
** TODO [#A] properly setup mode defun
:PROPERTIES:
:ID:       12f53f93-5bb5-4f94-9990-81bfe91d5316
:END:
:LOGBOOK:
CLOCK: [2026-01-01 Thu 09:45]--[2026-01-01 Thu 09:45] =>  0:00
CLOCK: [2026-01-01 Thu 03:50]--[2026-01-01 Thu 03:55] =>  0:05
CLOCK: [2025-12-01 Mon 01:53]--[2025-12-01 Mon 01:56] =>  0:03
CLOCK: [2025-11-21 Fri 20:16]--[2025-11-21 Fri 20:42] =>  0:26
CLOCK: [2025-11-21 Fri 15:12]--[2025-11-21 Fri 15:32] =>  0:20
CLOCK: [2025-11-20 Thu 12:41]--[2025-11-20 Thu 12:50] =>  0:09
CLOCK: [2025-11-11 Tue 18:13]--[2025-11-11 Tue 18:18] =>  0:05
CLOCK: [2025-11-11 Tue 18:03]--[2025-11-11 Tue 18:13] =>  0:10
CLOCK: [2025-11-10 Mon 12:18]--[2025-11-10 Mon 12:26] =>  0:08
CLOCK: [2025-11-09 Sun 07:20]--[2025-11-09 Sun 07:32] =>  0:12
CLOCK: [2025-11-09 Sun 04:56]--[2025-11-09 Sun 05:05] =>  0:09
CLOCK: [2025-11-09 Sun 04:45]--[2025-11-09 Sun 04:56] =>  0:11
:END:
#+begin_src emacs-lisp :tangle yes
*** TODO We need our own version of org-set-font-lock-defaults that only fontifies the table and timestamps and some texts
:LOGBOOK:
CLOCK: [2026-01-02 Fri 17:29]--[2026-01-02 Fri 17:32] =>  0:03
:END:
#+begin_src elisp :tangle yes
  (defun org-table-major-mode-set-font-lock-defaults ()
    "Set font lock defaults for the current buffer."
    (let ((org-font-lock-extra-keywords
  	 (list
  	  ;; Call the hook
  	  '(org-font-lock-hook)
  	  ;; Table lines
  	  '("^[ \t]*\\(\\(|\\|\\+-[-+]\\).*\\S-\\)\n?"
            (0 'org-table-row t)
  	    (1 'org-table t))
  	  ;; Table internals
  	  '("^[ \t]*|\\(?:.*?|\\)? *\\(:?=[^|\n]*\\)" (1 'org-formula t))
  	  '("^[ \t]*| *\\([#*]\\) *|" (1 'org-formula t))
  	  '("^[ \t]*|\\( *\\([$!_^/]\\) *|.*\\)|" (1 'org-formula t))
  	  '("| *\\(<[lrc]?[0-9]*>\\)" (1 'org-formula t))
  	  ;; Macro
  	  '(org-fontify-macros) ; `org-fontify-macro' pepends faces
  	  ;; Emphasis
          ;; `org-do-emphasis-faces' prepends faces
  	  (when org-fontify-emphasized-text '(org-do-emphasis-faces))
  	  ;; Checkboxes
  	  `(,org-list-full-item-re 3 'org-checkbox prepend lax)
  	  (when (cdr (assq 'checkbox org-list-automatic-rules))
  	    '("\\[\\([0-9]*%\\)\\]\\|\\[\\([0-9]*\\)/\\([0-9]*\\)\\]"
  	      (0 (org-get-checkbox-statistics-face) prepend)))
  	  ;; Specials
  	  '(org-do-latex-and-related) ; prepends faces
  	  '(org-fontify-entities) ; applies composition
  	  '(org-raise-scripts))))
  	 (setq org-font-lock-extra-keywords (delq nil org-font-lock-extra-keywords))
	   (run-hooks 'org-font-lock-set-keywords-hook)
	   ;; Now set the full font-lock-keywords
	   (setq-local org-font-lock-keywords org-font-lock-extra-keywords)
	   (setq-local font-lock-defaults
		       '(org-font-lock-keywords t nil nil backward-paragraph))
	   (setq-local font-lock-extend-after-change-region-function
		       #'org-fontify-extend-region)
	   (kill-local-variable 'font-lock-keywords)
  	  nil))




#+end_src

#+RESULTS:
: org-table-major-mode-set-font-lock-defaults

*** defun
#+begin_src elisp :tangle yes
    (fmakunbound 'orgtbl-major-mode-defun)
  (defun orgtbl-major-mode-defun ()
    (require 'org)
    (require 'org-table)
    (setq-local truncate-lines t))


  (fmakunbound 'orgtbl-major-mode)
  (define-derived-mode orgtbl-major-mode nil "orgtbl-major-mode"
    "Major mode for org tables"
    :syntax-table org-mode-syntax-table
    ;;:abbrev-table org-mode-abbrev-table
    :interactive t
    (orgtbl-major-mode-defun))


#+end_src
#+RESULTS:
: orgtbl-major-mode
** TODO [#C] org-table-narrow-to-x-rows - narrower?
#+begin_src elisp :tangle yes
  (defun org-table-narrow-to-first-x-rows (n)
    (interactive "n") 
    (narrow-to-region (org-table-begin) (save-excursion (org-table-goto-line n) (point))))
#+end_src
** TODO org-table-narrow-scrolling
* TODO End
:PROPERTIES:
:ID:       7692e202-0bc1-484d-8288-d0fd64356b8c
:END:
#+begin_src elisp :tangle yes
  (provide 'orgtbl-major-mode)
  ;;; orgtbl-major-mode.el ends here
#+end_src

